WesDoesStuff/SmartRC-CC2500-Driver-Lib/CC2500_SRC_DRV.cpp
/*
  Based on:
            CC2500.cpp module library
            Copyright (c) 2010 Michael.
              Author: Michael, <www.elechouse.com>
              Version: November 12, 2010

  This library is designed to use CC2500 module on Arduino platform.
  CC2500 module is an useful wireless module. Using the functions of the 
  library, you can easily send and receive data by the CC2500 module. 
  Just have fun!
  For the details, please refer to the datasheet of CC2500.

----------------------------------------------------------------------------------------------------------------
cc2500 Driver. Wesley Smoyak [Feat. Little Satan and Wilson Shen (ELECHOUSE).]
----------------------------------------------------------------------------------------------------------------
*/
#include <SPI.h>
#include "CC2500_SRC_DRV.h"
#include <Arduino.h>
#include <math.h>

/****************************************************************/
#define   WRITE_SINGLE      0x00
#define   WRITE_BURST       0x40            //write burst
#define   READ_SINGLE       0x80            //read single
#define   READ_BURST        0xC0            //read burst
#define   READ_STATUS       0xC0

#define   BYTES_IN_RXFIFO   0x7F            //byte number in RXfifo
#define   max_modul 6

byte modulation = 2;
byte frend0;
byte chan = 0;
int pa = 1;
byte last_pa;
byte SCK_PIN;
byte MISO_PIN;
byte MOSI_PIN;
byte SS_PIN;
byte GDO0;
byte GDO2;
byte SCK_PIN_M[max_modul];
byte MISO_PIN_M[max_modul];
byte MOSI_PIN_M[max_modul];
byte SS_PIN_M[max_modul];
byte GDO0_M[max_modul];
byte GDO2_M[max_modul];
byte gdo_set=0;
bool spi = 0;
bool ccmode = 0;
float MHz = 2400.000;
byte m4RxBw = 0;
byte m4DaRa;
byte m2DCOFF;
byte m2MODFM;
byte m2MANCH;
byte m2SYNCM;
byte m1FEC;
byte m1PRE;
byte m1CHSP;
byte mc0XOSC_FORCE_ON;
byte mc0PIN_CTRL_EN;
byte mc0PO_TIMEOUT;
byte mc0FS_AUTOCAL;
byte pc1PQT;
byte pc1CRC_AF;
byte pc1APP_ST;
byte pc1ADRCHK;
byte pc0WDATA;
byte pc0PktForm;
byte pc0CC2400_EN;
byte pc0CRC_EN;
byte pc0LenConf;
byte trxstate = 0;
float XOSC = 26;
float frequecy_band[2]{2400.000, 2483.500};
byte clb1[2]= {24,28};
byte clb2[2]= {31,38};
byte clb3[2]= {65,76};
byte clb4[2]= {77,79};

/****************************************************************/
uint8_t PA_TABLE[8]     {0x00,0x46,0x55,0x97,0xA9,0xBB,0xFE,0xFF};
//                       -55  -20  -16  -10   -4   -2    0   +1
uint8_t PA_WRITE[8]     {0x00,0xFF,0x00,0x00,0x00,0x00,0x00,0x00};

/****************************************************************
*FUNCTION NAME:SpiStart
*FUNCTION     :spi communication start
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::SpiStart(void){
  // initialize the SPI pins
  pinMode(SCK_PIN, OUTPUT);
  pinMode(MOSI_PIN, OUTPUT);
  pinMode(MISO_PIN, INPUT);
  pinMode(SS_PIN, OUTPUT);

  // enable SPI
  #ifdef ESP32
  SPI.begin(SCK_PIN, MISO_PIN, MOSI_PIN, SS_PIN);
  #else
  SPI.begin();
  #endif
}
/****************************************************************
*FUNCTION NAME:SpiEnd
*FUNCTION     :spi communication disable
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::SpiEnd(void){
  // disable SPI
  SPI.endTransaction();
  SPI.end();
}
/****************************************************************
*FUNCTION NAME: GDO_Set()
*FUNCTION     : set GDO0,GDO2 pin for serial pinmode.
*INPUT        : none
*OUTPUT       : none
****************************************************************/
void CC2500::GDO_Set (void){
	pinMode(GDO0, OUTPUT);
	pinMode(GDO2, INPUT);
}
/****************************************************************
*FUNCTION NAME: GDO_Set()
*FUNCTION     : set GDO0 for internal transmission mode.
*INPUT        : none
*OUTPUT       : none
****************************************************************/
void CC2500::GDO0_Set (void){
  pinMode(GDO0, INPUT);
}
/****************************************************************
*FUNCTION NAME:Reset
*FUNCTION     :CC2500 reset //details refer datasheet of CC2500
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::Reset (void){
  digitalWrite(SS_PIN, LOW);
  delay(1);
  digitalWrite(SS_PIN, HIGH);
  delay(1);
  digitalWrite(SS_PIN, LOW);
  SPI.beginTransaction(SPISettings(8000000, MSBFIRST, SPI_MODE0));
  while(digitalRead(MISO_PIN));
  SPI.transfer(CC2500_SRES);
  while(digitalRead(MISO_PIN));
  digitalWrite(SS_PIN, HIGH);
}
/****************************************************************
*FUNCTION NAME:Init
*FUNCTION     :CC2500 initialization
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::Init(void){
  setSpi();
  SpiStart();                   //spi initialization
  digitalWrite(SS_PIN, HIGH);
  digitalWrite(SCK_PIN, HIGH);
  digitalWrite(MOSI_PIN, LOW);
  Reset();                      //CC2500 reset
  RegConfigSettings();          //CC2500 register config
  SpiEnd();
}
/****************************************************************
*FUNCTION NAME:SpiWriteReg
*FUNCTION     :CC2500 write data to register
*INPUT        :addr: register address; value: register value
*OUTPUT       :none
****************************************************************/
void CC2500::SpiWriteReg(byte addr, byte value){
  SpiStart();
  digitalWrite(SS_PIN, LOW);
  SPI.beginTransaction(SPISettings(8000000, MSBFIRST, SPI_MODE0));
  while(digitalRead(MISO_PIN));
  SPI.transfer(addr);
  SPI.transfer(value); 
  digitalWrite(SS_PIN, HIGH);
  SpiEnd();
}
/****************************************************************
*FUNCTION NAME:SpiWriteBurstReg
*FUNCTION     :CC2500 write burst data to register
*INPUT        :addr: register address; buffer:register value array; num:number to write
*OUTPUT       :none
****************************************************************/
void CC2500::SpiWriteBurstReg(byte addr, byte *buffer, byte num){
  byte i, temp;
  SpiStart();
  temp = addr | WRITE_BURST;
  digitalWrite(SS_PIN, LOW);
  SPI.beginTransaction(SPISettings(8000000, MSBFIRST, SPI_MODE0));
  while(digitalRead(MISO_PIN));
  SPI.transfer(temp);
  for (i = 0; i < num; i++){
    SPI.transfer(buffer[i]);
  }
  digitalWrite(SS_PIN, HIGH);
  SpiEnd();
}
/****************************************************************
*FUNCTION NAME:SpiStrobe
*FUNCTION     :CC2500 Strobe
*INPUT        :strobe: command; //refer define in CC2500.h//
*OUTPUT       :none
****************************************************************/
void CC2500::SpiStrobe(byte strobe){
  SpiStart();
  digitalWrite(SS_PIN, LOW);
  SPI.beginTransaction(SPISettings(8000000, MSBFIRST, SPI_MODE0));
  while(digitalRead(MISO_PIN));
  SPI.transfer(strobe);
  digitalWrite(SS_PIN, HIGH);
  SpiEnd();
}
/****************************************************************
*FUNCTION NAME:SpiReadReg
*FUNCTION     :CC2500 read data from register
*INPUT        :addr: register address
*OUTPUT       :register value
****************************************************************/
byte CC2500::SpiReadReg(byte addr){
  byte temp, value;
  SpiStart();
  temp = addr| READ_SINGLE;
  digitalWrite(SS_PIN, LOW);
  SPI.beginTransaction(SPISettings(8000000, MSBFIRST, SPI_MODE0));
  while(digitalRead(MISO_PIN));
  SPI.transfer(temp);
  value=SPI.transfer(0);
  digitalWrite(SS_PIN, HIGH);
  SpiEnd();
  return value;
}

/****************************************************************
*FUNCTION NAME:SpiReadBurstReg
*FUNCTION     :CC2500 read burst data from register
*INPUT        :addr: register address; buffer:array to store register value; num: number to read
*OUTPUT       :none
****************************************************************/
void CC2500::SpiReadBurstReg(byte addr, byte *buffer, byte num){
  byte i,temp;
  SpiStart();
  temp = addr | READ_BURST;
  digitalWrite(SS_PIN, LOW);
  SPI.beginTransaction(SPISettings(8000000, MSBFIRST, SPI_MODE0));
  while(digitalRead(MISO_PIN));
  SPI.transfer(temp);
  for(i=0;i<num;i++){
    buffer[i]=SPI.transfer(0);
  }
  digitalWrite(SS_PIN, HIGH);
  SpiEnd();
}

/****************************************************************
*FUNCTION NAME:SpiReadStatus
*FUNCTION     :CC2500 read status register
*INPUT        :addr: register address
*OUTPUT       :status value
****************************************************************/
byte CC2500::SpiReadStatus(byte addr){
  byte value,temp;
  SpiStart();
  temp = addr | READ_BURST;
  digitalWrite(SS_PIN, LOW);
  SPI.beginTransaction(SPISettings(8000000, MSBFIRST, SPI_MODE0));
  while(digitalRead(MISO_PIN));
  SPI.transfer(temp);
  value=SPI.transfer(0);
  digitalWrite(SS_PIN, HIGH);
  SpiEnd();
  return value;
}
/****************************************************************
*FUNCTION NAME:SPI pin Settings
*FUNCTION     :Set Spi pins
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setSpi(void){
  if (spi == 0){
    #if defined __AVR_ATmega168__ || defined __AVR_ATmega328P__
      SCK_PIN = 13; MISO_PIN = 12; MOSI_PIN = 11; SS_PIN = 10;
    #elif defined __AVR_ATmega1280__ || defined __AVR_ATmega2560__
      SCK_PIN = 52; MISO_PIN = 50; MOSI_PIN = 51; SS_PIN = 53;
    #elif ESP8266
      SCK_PIN = 14; MISO_PIN = 12; MOSI_PIN = 13; SS_PIN = 15;
    #elif ESP32
      SCK_PIN = 18; MISO_PIN = 19; MOSI_PIN = 23; SS_PIN = 5;
    #else
      SCK_PIN = 13; MISO_PIN = 12; MOSI_PIN = 11; SS_PIN = 10;
    #endif
  }
}
/****************************************************************
*FUNCTION NAME:COSTUM SPI
*FUNCTION     :set costum spi pins.
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setSpiPin(byte sck, byte miso, byte mosi, byte ss){
  spi = 1;
  SCK_PIN = sck;
  MISO_PIN = miso;
  MOSI_PIN = mosi;
  SS_PIN = ss;
}
/****************************************************************
*FUNCTION NAME:COSTUM SPI
*FUNCTION     :set costum spi pins.
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::addSpiPin(byte sck, byte miso, byte mosi, byte ss, byte modul){
  spi = 1;
  SCK_PIN_M[modul] = sck;
  MISO_PIN_M[modul] = miso;
  MOSI_PIN_M[modul] = mosi;
  SS_PIN_M[modul] = ss;
}
/****************************************************************
*FUNCTION NAME:GDO Pin settings
*FUNCTION     :set GDO Pins
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setGDO(byte gdo0, byte gdo2){
  GDO0 = gdo0;
  GDO2 = gdo2;  
  GDO_Set();
}
/****************************************************************
*FUNCTION NAME:GDO0 Pin setting
*FUNCTION     :set GDO0 Pin
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setGDO0(byte gdo0){
  GDO0 = gdo0;
  GDO0_Set();
}
/****************************************************************
*FUNCTION NAME:GDO Pin settings
*FUNCTION     :add GDO Pins
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::addGDO(byte gdo0, byte gdo2, byte modul){
  GDO0_M[modul] = gdo0;
  GDO2_M[modul] = gdo2;  
  gdo_set=2;
  GDO_Set();
}
/****************************************************************
*FUNCTION NAME:add GDO0 Pin
*FUNCTION     :add GDO0 Pin
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::addGDO0(byte gdo0, byte modul){
  GDO0_M[modul] = gdo0;
  gdo_set=1;
  GDO0_Set();
}
/****************************************************************
*FUNCTION NAME:set Modul
*FUNCTION     :change modul
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setModul(byte modul){
  SCK_PIN = SCK_PIN_M[modul];
  MISO_PIN = MISO_PIN_M[modul];
  MOSI_PIN = MOSI_PIN_M[modul];
  SS_PIN = SS_PIN_M[modul];
  if (gdo_set==1){
    GDO0 = GDO0_M[modul];
  }else if (gdo_set==2){
    GDO0 = GDO0_M[modul];
    GDO2 = GDO2_M[modul];
  }
}
/****************************************************************
*FUNCTION NAME:CCMode (not used now. maybe later? idk)
*FUNCTION     :Format of RX and TX data
*INPUT        :none
*OUTPUT       :none
****************************************************************/
/*
void CC2500::setCCMode(bool s){
  ccmode = s;
  if (ccmode == 1){
    SpiWriteReg(CC1101_IOCFG2,      0x0B);
    SpiWriteReg(CC1101_IOCFG0,      0x06);
    SpiWriteReg(CC1101_PKTCTRL0,    0x05);
    SpiWriteReg(CC1101_MDMCFG3,     0xF8);
    SpiWriteReg(CC1101_MDMCFG4,11+m4RxBw);
  }else{
    SpiWriteReg(CC1101_IOCFG2,      0x0D);
    SpiWriteReg(CC1101_IOCFG0,      0x0D);
    SpiWriteReg(CC1101_PKTCTRL0,    0x32);
    SpiWriteReg(CC1101_MDMCFG3,     0x93);
    SpiWriteReg(CC1101_MDMCFG4, 7+m4RxBw);
  }
  setModulation(modulation);
}
*/
/****************************************************************
*FUNCTION NAME:Modulation
*FUNCTION     :set CC2500 Modulation 
*INPUT        :none
*OUTPUT       :none
*NOTES        :(Available Modulations are 2-FSK, GFSK, ASK/OOK, MSK) also supports FHSS
****************************************************************/
void CC2500::setModulation(byte m){
  if (m>3){
    m=3;
  }
  modulation = m;
  Split_MDMCFG2();
  switch (m){
    case 0:         // 2-FSK
      m2MODFM=0x02;
      frend0=0x10;
      break;
    case 1:         // GFSK
      m2MODFM=0x12;
      frend0=0x10;
      break;
    case 2:         // ASK/OOK
      m2MODFM=0x32;
      frend0=0x11;
      break;
//    case 3: m2MODFM=0x42; frend0=0x10; break; // 4-FSK (no 4-FSK for CC2500
    case 3:         // MSK
      m2MODFM=0x72;
      frend0=0x10;
      break;
  }
  SpiWriteReg(CC2500_MDMCFG2, m2DCOFF+m2MODFM+m2MANCH+m2SYNCM);
  SpiWriteReg(CC2500_FREND0,   frend0);
  setPA(pa);
}
/****************************************************************
*FUNCTION NAME:PA Power
*FUNCTION     :set CC2500 PA Power 
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setPA(int p){
  int a;
  pa = p;

  if (pa <= -55){
    a = PA_TABLE[0];
  }else if (pa > -55 && pa <= -20){
    a = PA_TABLE[1];
  }else if (pa > -20 && pa <= -16){
    a = PA_TABLE[2];
  }else if (pa > -16 && pa <= -10){
    a = PA_TABLE[3];
  }else if (pa > -10 && pa <= -4){
    a = PA_TABLE[4];
  }else if (pa > -4 && pa <= -2){
    a = PA_TABLE[5];
  }else if (pa > -2 && pa <= 0){
    a = PA_TABLE[6];
  }else if (pa > 0){
    a = PA_TABLE[7];
  }
  last_pa = 1;

  if (modulation == 2){
    PA_WRITE[0] = 0;  
    PA_WRITE[1] = a;
  }else{
    PA_WRITE[0] = a;  
    PA_WRITE[1] = 0; 
  }
  
  SpiWriteBurstReg(CC2500_PATABLE,PA_TABLE,8);
}
/****************************************************************
*FUNCTION NAME:Frequency Calculator
*FUNCTION     :Calculate the basic frequency.
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setMHZ(float mhz){
  byte freq[3] = {0, 0, 0};
  if(mhz < frequecy_band[0]){
    mhz = frequecy_band[0];
  }else if(mhz > frequecy_band[1]){
    mhz = frequecy_band[1];
  }
  MHz = mhz;

  // Calculate the frequency value for freq2
  freq[2] = static_cast<byte>(mhz / 26);
  mhz -= freq[2] * 26;

  // Calculate the frequency value for freq1
  freq[1] = static_cast<byte>(mhz / 0.1015625);
  mhz -= freq[1] * 0.1015625;

  // Calculate the frequency value for freq0
  freq0 = static_cast<byte>(mhz / 0.000396469);

