WesDoesStuff/SmartRC-CC2500-Driver-Lib/CC2500_SRC_DRV.cpp
  // Adjust the frequency values if necessary
  for(int i=0;i<2;i++;){
    if(freq[i] > 255){
      freq[i+1] += 1;
      freq[i] -= 256;
    }
  }

/*//this was the original function.
  for (bool i = 0; i==0;){
    if (mhz >= 26){
      mhz-=26;
	  freq2+=1;
    }else if (mhz >= 0.1015625){
      mhz-=0.1015625;
      freq1+=1;
    }else if (mhz >= 0.00039675){
      mhz-=0.00039675;
      freq0+=1;
    }else{
      i=1;
    }
  }
  
  
  if (freq0 > 255){
    freq1+=1;
    freq0-=256;
  }
*/
  
  SpiWriteReg(CC2500_FREQ2, freq2);
  SpiWriteReg(CC2500_FREQ1, freq1);
  SpiWriteReg(CC2500_FREQ0, freq0);
  
  Calibrate();
}
/****************************************************************
*FUNCTION NAME:Calibrate
*FUNCTION     :Calibrate frequency
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::Calibrate(void){
  
  SpiStrobe(CC2500_SCAL); // manual calibration
  
}

/*
/****************************************************************
*FUNCTION NAME:Calibration offset  (not used at the moment)
*FUNCTION     :Set calibration offset
*INPUT        :none
*OUTPUT       :none
****************************************************************
void CC2500::setClb(byte b, byte s, byte e){
  if (b == 1){
    clb1[0]=s;
    clb1[1]=e;  
  }else if (b == 2){
    clb2[0]=s;
    clb2[1]=e;  
  }else if (b == 3){
    clb3[0]=s;
    clb3[1]=e;  
  }else if (b == 4){
    clb4[0]=s;
    clb4[1]=e;  
  }
}
*/

/****************************************************************
*FUNCTION NAME:getCC2500
*FUNCTION     :Test Spi connection and return 1 when true.
*INPUT        :none
*OUTPUT       :none
****************************************************************/
bool CC2500::getCC2500(void){
  setSpi();
  if (SpiReadStatus(CC2500_VERSION) == 0x3){
    return 1;
  }else{
    return 0;
  }
}
/****************************************************************
*FUNCTION NAME:getMode
*FUNCTION     :Return the Mode. Sidle = 0, TX = 1, Rx = 2.
*INPUT        :none
*OUTPUT       :none
****************************************************************/
byte CC2500::getMode(void){
  return trxstate;
}
/****************************************************************
*FUNCTION NAME:Set Sync_Word
*FUNCTION     :Sync Word
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setSyncWord(byte sh, byte sl){
  SpiWriteReg(CC2500_SYNC1, sh);
  SpiWriteReg(CC2500_SYNC0, sl);
}
/****************************************************************
*FUNCTION NAME:Set ADDR
*FUNCTION     :Address used for packet filtration. Optional broadcast addresses are 0 (0x00) and 255 (0xFF).
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setAddr(byte v){
  SpiWriteReg(CC2500_ADDR, v);
}
/****************************************************************
*FUNCTION NAME:Set PQT
*FUNCTION     :Preamble quality estimator threshold
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setPQT(byte v){
  Split_PKTCTRL1();
  pc1PQT = 0;
  if (v>7){
    v=7;
  }
  pc1PQT = v*32;
  SpiWriteReg(CC2500_PKTCTRL1, pc1PQT+pc1CRC_AF+pc1APP_ST+pc1ADRCHK);
}
/****************************************************************
*FUNCTION NAME:Set CRC_AUTOFLUSH
*FUNCTION     :Enable automatic flush of RX FIFO when CRC is not OK
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setCRC_AF(bool v){
  Split_PKTCTRL1();
  pc1CRC_AF = 0;
  if (v==1){
    pc1CRC_AF=8;
  }
  SpiWriteReg(CC2500_PKTCTRL1, pc1PQT+pc1CRC_AF+pc1APP_ST+pc1ADRCHK);
}
/****************************************************************
*FUNCTION NAME:Set APPEND_STATUS
*FUNCTION     :When enabled, two status bytes will be appended to the payload of the packet
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setAppendStatus(bool v){
  Split_PKTCTRL1();
  pc1APP_ST = 0;
  if (v==1){
    pc1APP_ST=4;
  }
  SpiWriteReg(CC2500_PKTCTRL1, pc1PQT+pc1CRC_AF+pc1APP_ST+pc1ADRCHK);
}
/****************************************************************
*FUNCTION NAME:Set ADR_CHK
*FUNCTION     :Controls address check configuration of received packages
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setAdrChk(byte v){
  Split_PKTCTRL1();
  pc1ADRCHK = 0;
  if (v>3){
    v=3;
  }
  pc1ADRCHK = v;
  SpiWriteReg(CC2500_PKTCTRL1, pc1PQT+pc1CRC_AF+pc1APP_ST+pc1ADRCHK);
}
/****************************************************************
*FUNCTION NAME:Set WHITE_DATA
*FUNCTION     :Turn data whitening on / off.
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setWhiteData(bool v){
  Split_PKTCTRL0();
  pc0WDATA = 0;
  if (v == 1){
    pc0WDATA=64;
  }
  SpiWriteReg(CC2500_PKTCTRL0, pc0WDATA+pc0PktForm+pc0CC2400_EN+pc0CRC_EN+pc0LenConf);
}
/****************************************************************
*FUNCTION NAME:Set PKT_FORMAT
*FUNCTION     :Format of RX and TX data
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setPktFormat(byte v){
  Split_PKTCTRL0();
  pc0PktForm = 0;
  if (v>3){
    v=3;
  }
  pc0PktForm = v*16;
  SpiWriteReg(CC2500_PKTCTRL0, pc0WDATA+pc0PktForm+pc0CC2400_EN+pc0CRC_EN+pc0LenConf);
}
/****************************************************************
*FUNCTION NAME:Set CC2400_EN
*FUNCTION     :Enable CC2400 support. Use same CRC implementation as CC2400.
*INPUT        :none
*OUTPUT       :none
NOTE          :If enabled,
                PKTCTRL1.CRC_AUTOFLUSH must be 0
                PKTCTRL0.WHITE_DATA must be 0
                So this function sets those settings when enabled but does not reset them when you disable.
****************************************************************/
void CC2500::setCC2400_EN(bool v){
  Split_PKTCTRL0();
  pc0CRC_EN = 0;
  if (v==1){
    setWhiteData(0);
    setCRC_AF(0);
    pc0CRC_EN=4;
  }
  SpiWriteReg(CC2500_PKTCTRL0, pc0WDATA+pc0PktForm+pc0CC2400_EN+pc0CRC_EN+pc0LenConf);
}
/****************************************************************
*FUNCTION NAME:Set CRC
*FUNCTION     :CRC calculation in TX and CRC check in RX
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setCrc(bool v){
  Split_PKTCTRL0();
  pc0CRC_EN = 0;
  if (v==1){
    pc0CRC_EN=4;
  }
  SpiWriteReg(CC2500_PKTCTRL0, pc0WDATA+pc0PktForm+pc0CC2400_EN+pc0CRC_EN+pc0LenConf);
}
/****************************************************************
*FUNCTION NAME:Set LENGTH_CONFIG
*FUNCTION     :Configure the packet length
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setLengthConfig(byte v){
  Split_PKTCTRL0();
  pc0LenConf = 0;
  if (v>3){
    v=3;
  }
  pc0LenConf = v;
  SpiWriteReg(CC2500_PKTCTRL0, pc0WDATA+pc0PktForm+pc0CC2400_EN+pc0CRC_EN+pc0LenConf);
}
/****************************************************************
*FUNCTION NAME:Set Auto Calibration settings
*FUNCTION     :change setting for frequency auto calibration
*INPUT        :[0],1,2,3
*OUTPUT       :none
*NOTE         :FS_AUTOCAL (bit 4-5 [default  0x10]) Automatically calibrate when going to RX or TX, or back to IDLE
****************************************************************/
void CC2500::setAutoCal(byte v){
  Split_MCSM0();
  mc0FS_AUTOCAL = 0;
  if(v > 3){
    v = 3;
  }
  mc0FS_AUTOCAL = v*16;
  SpiWriteReg(CC2500_MCSM0, mc0FS_AUTOCAL+mc0PO_TIMEOUT+mc0PIN_CTRL_EN+mc0XOSC_FORCE_ON);
}
/****************************************************************
*FUNCTION NAME:Set PO Timeout
*FUNCTION     :Programs the number of times the six-bit ripple counter must expire after XOSC has stabilized before CHP_RDYn goes low.
*INPUT        :0,[1],2,3
*OUTPUT       :none
****************************************************************/
void CC2500::setPOTimeout(byte v){
  Split_MCSM0();
  mc0PO_TIMEOUT = 0;
  if(v > 3){
    v = 3;
  }
  mc0PO_TIMEOUT = v*4;
  SpiWriteReg(CC2500_MCSM0, mc0FS_AUTOCAL+mc0PO_TIMEOUT+mc0PIN_CTRL_EN+mc0XOSC_FORCE_ON);
}
/****************************************************************
*FUNCTION NAME:PIN_CTRL_EN
*FUNCTION     :Enables the pin radio control option
*INPUT        :[0],1
*OUTPUT       :none
****************************************************************/
void CC2500::setPinCtrl(bool v){
  Split_MCSM0();
  mc0PIN_CTRL_EN = 0;
  if(v == 1){
    mc0PIN_CTRL_EN = 2; 
  }
  SpiWriteReg(CC2500_MCSM0, mc0FS_AUTOCAL+mc0PO_TIMEOUT+mc0PIN_CTRL_EN+mc0XOSC_FORCE_ON);
}
/****************************************************************
*FUNCTION NAME:XOSC_FORCE_ON
*FUNCTION     :Force the XOSC to stay on in the SLEEP state.
*INPUT        :[0],1
*OUTPUT       :none
****************************************************************/
void CC2500::setXOSCForceOn(bool v){
  Split_MCSM0();
  mc0XOSC_FORCE_ON = 0;
  if(v == 1){
    mc0XOSC_FORCE_ON = 1;
  }
  SpiWriteReg(CC2500_MCSM0, mc0FS_AUTOCAL+mc0PO_TIMEOUT+mc0PIN_CTRL_EN+mc0XOSC_FORCE_ON);
}
/****************************************************************
*FUNCTION NAME:Set PACKET_LENGTH
*FUNCTION     :Indicates the packet length
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setPacketLength(byte v){
  SpiWriteReg(CC2500_PKTLEN, v);
}
/****************************************************************
*FUNCTION NAME:Set DCFILT_OFF
*FUNCTION     :Disable digital DC blocking filter before demodulator
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setDcFilterOff(bool v){
  Split_MDMCFG2();
  m2DCOFF = 0;
  if (v==1){
    m2DCOFF=128;
  }
  SpiWriteReg(CC2500_MDMCFG2, m2DCOFF+m2MODFM+m2MANCH+m2SYNCM);
}
/****************************************************************
*FUNCTION NAME:Set MANCHESTER
*FUNCTION     :Enables Manchester encoding/decoding
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setManchester(bool v){
  Split_MDMCFG2();
  m2MANCH = 0;
  if (v==1){
    m2MANCH=8;
  }
  SpiWriteReg(CC2500_MDMCFG2, m2DCOFF+m2MODFM+m2MANCH+m2SYNCM);
}
/****************************************************************
*FUNCTION NAME:Set SYNC_MODE
*FUNCTION     :Combined sync-word qualifier mode
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setSyncMode(byte v){
  Split_MDMCFG2();
  m2SYNCM = 0;
  if (v>7){
    v=7;
  }
  m2SYNCM=v;
  SpiWriteReg(CC2500_MDMCFG2, m2DCOFF+m2MODFM+m2MANCH+m2SYNCM);
}
/****************************************************************
*FUNCTION NAME:Set FEC
*FUNCTION     :Enable Forward Error Correction (FEC)
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setFEC(bool v){
  Split_MDMCFG1();
  m1FEC=0;
  if (v==1){
    m1FEC=128;
  }
  SpiWriteReg(CC2500_MDMCFG1, m1FEC+m1PRE+m1CHSP);
}
/****************************************************************
*FUNCTION NAME:Set PRE
*FUNCTION     :Sets the minimum number of preamble bytes to be transmitted.
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setPRE(byte v){
  Split_MDMCFG1();
  m1PRE=0;
  if (v>7){
    v=7;
  }
  m1PRE = v*16;
  SpiWriteReg(CC2500_MDMCFG1, m1FEC+m1PRE+m1CHSP);
}
/****************************************************************
*FUNCTION NAME:Set Channel
*FUNCTION     :none
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setChannel(byte ch){
  chan = ch;
  SpiWriteReg(CC2500_CHANNR,   chan);
}
/****************************************************************
*FUNCTION NAME:Set Channel spacing
*FUNCTION     :none
*INPUT        :none
*OUTPUT       :none
*NOTE         :carrier = (XOSC / 2^16) * ((FREQ + CHAN) * ((256 + CHANSPC_M) * 2^(CHANSPC_E-2))
               MAX  = 405.456543 max channel spacing
               MIN  = 25.390625 min channel spacing
****************************************************************/
void CC2500::setChsp(float f){
  Split_MDMCFG1();
  byte MDMCFG0 = 0;
  m1CHSP = 0;
  if (f > 405.456543){
    f = 405.456543;
  }
  if (f < 25.390625){
    f = 25.390625;
  }
  for (int i = 0; i<5; i++){
    if (f <= 50.682068){
      f -= 25.390625;
      f /= 0.0991825;
      MDMCFG0 = f;
      float s1 = (f - MDMCFG0) *10;
      if (s1 >= 5){
        MDMCFG0++;
      }
      i = 5;
    }else{
      m1CHSP++;
      f/=2;
    }
  }
  SpiWriteReg(CC2500_MDMCFG1, m1CHSP+m1FEC+m1PRE);
  SpiWriteReg(CC2500_MDMCFG0, MDMCFG0);
}
/****************************************************************
*FUNCTION NAME:Set Receive bandwidth
*FUNCTION     :none
*INPUT        :none
*OUTPUT       :none
*NOTE         :BWchannel = XOSC/(8 * (4 + CHANBW_M)*2^CHANBW_E
               MAX  = 13/.016 = 812.50 kHz
               MIN  = 13/.224 =  58.03 kHz
               BW Filters are limited to the following
               812.500, 650.000, 541.667, 464.286,406.250,325.000,270.833,232.143,203.125, 162.500, 135.416, 116.071, 101.563,  81.250,  67.708,  58.036
   Frequency   1625/2, 1625/2.5, 1625/3, 1625/3.5, 1625/4, 1625/5, 1625/6, 1625/7, 1625/8, 1625/10, 1625/12, 1625/14, 1625/16, 1625/20, 1625/24, 1625/28
m4RxBw Value    0x00    0x10      0x20    0x30      0x40    0x50    0x60    0x70    0x80    0x90     0xA0     0xB0     0xC0     0xD0     0xE0     0xF0
              The origial function is so elegant in it's aproximation that I almost hate to change it however, because the RX bandwidth can only be one of 16 values, 
              when you set the bandwith, you were not getting the closest bandwith to what you had requested. This function is not as elegant and is probably less efficent however, 
              it will get you a RX bandwidth closer to the one you requested. The array consists of the mid-point frequencies between the possible ones. There is also a pattern to 
              the frequencies but I couln't figure out an easy way from A to B without going into polynomials. 
****************************************************************/
void CC2500::setRxBW(float f){
  uint32_t bw = (f*1000000);
  Split_MDMCFG4();
  byte em = 0;
  uint32_t freq[16] = {731250000,595833000,502976000,435286000,365625000,297917000,251488000,217634000,182813000,148958000,125744000,108817000,91406000,74479000,62872000,0};
  for(int i=0;i<16;i++){
    if(bw>freq[i]){
      break;
    }else if(em >= 0xF0){
      em = 0xF0;
      break;
    }else{
      em+=0x10;
    }
  }
  m4RxBw = em;
  SpiWriteReg(CC2500_MDMCFG4, m4RxBw+m4DaRa);
}
/*  
void CC2500::setRxBW(float f){
  Split_MDMCFG4();
  int s1 = 3;
  int s2 = 3;
  for (int i = 0; i<3; i++){
    if (f > 101.5625){
      f/=2;
      s1--;
    }else{
      i=3;
    }
  }
  for (int i = 0; i<3; i++){
    if (f > 58.1){
      f/=1.25;
      s2--;
    }else{
      i=3;
    }
  }
  s1 *= 64;
  s2 *= 16;
  m4RxBw = s1 + s2;
  SpiWriteReg(16,m4RxBw+m4DaRa);
}
*/
/****************************************************************
*FUNCTION NAME:Set Data Rate
*FUNCTION     :none
*INPUT        :none
*OUTPUT       :none
*NOTE         :Data Rate  = (((256 + DRATE_M)*2^DRATE_E)/2^28)*XOSC
                DRATE_E   = log2((DataRate * 2^20)/XOSC)
                DRATE_M   = ((DataRate * 2^28)/(XOSC*2^DRATE_E))-256
                DRATE_M   = ((DataRate * 2^28)/(XOSC*2^(log2((DataRate * 2^20)/XOSC))))-256
                MIN       = 13000/524288    ~   0.02479553
                MAX       = 6642000/4096    ~1621.58203125
          Increment       = 13000/134217728 ~   0.00009685754776000977
****************************************************************/
void CC2500::setDRate(float d){
  
  Split_MDMCFG4();
  float max = 1621.58203125;    // Maximum Data Rate with 26MHz crystal
  float min = 0.02479553;       // Minimum Data Rate with 26MHz crystal (this is also the increment value when you increase DRATE_E)
  float inc = 13000/134217728;  // Smallest increment between Data Rates with 26MHz crystal
  float c = d;
  byte MDMCFG3 = 0;
  if (c > max){
    c = max;
  }
  if (c < min){
    c = min;
  }
  m4DaRa = 0;
  for (int i = 0; i<20; i++){
    if (c <= 0.0494942){
      c = c - min;
      c = c / inc;
      MDMCFG3 = c;
      float s1 = (c - MDMCFG3) *10;
      if (s1 >= 5){
        MDMCFG3++;
      }
      i = 20;
    }else{
      m4DaRa++;
      c = c/2;
    }
  }
  SpiWriteReg(CC2500_MDMCFG4,  m4RxBw+m4DaRa);
  SpiWriteReg(CC2500_MDMCFG3,  MDMCFG3);
}
/****************************************************************
*FUNCTION NAME:Set Devitation
*FUNCTION     :none
*INPUT        :none
*OUTPUT       :none
*NOTE         :Deviation    = (XOSC/(2^17))*(8 + DEVIATN_M)*2^DEVIATN_E
                     MIN    =  13000/8192   ~  1.5869140625
                     MAX    = 195000/512    ~380.859375
               INCREMENT    =  13000/65336  ~  0.1989714705522224
\****************************************************************/
void CC2500::setDeviation(float d){
  
