WesDoesStuff/SmartRC-CC2500-Driver-Lib/CC2500_SRC_DRV.cpp
  float m = 195000/512;      // Maximum Deviation with 26MHz crystal
  float f = 13000/8192;       // Minimum Deviation with 26MHz crystal (this is also the increment value when you increase DEVIATN_E)
  float v = 13000/65336;      // Smallest increment between Deviations with 26MHz crystal
  int c = 0;
  if (d > m){        
    d = m;
  }
  if (d < f){
    d = f;
  }
  
  for (int i = 0; i<255; i++){
    f+=v;
    if (c==7){
      v*=2;
      c=-1;
      i+=8;
    }
    if (f>=d){
      c=i;
      i=255;
    }
  c++;
  }
  SpiWriteReg(CC2500_DEVIATN,c);
}
/****************************************************************
*FUNCTION NAME:Split PKTCTRL1
*FUNCTION     :none
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::Split_PKTCTRL1(void){
  int calc = SpiReadStatus(7);
  pc1PQT = 0;
  pc1CRC_AF = 0;
  pc1APP_ST = 0;
  pc1ADRCHK = 0;
  for (bool i = 0; i==0;){
    if (calc >= 32){
      calc-=32; 
      pc1PQT+=32;
    }else if (calc >= 8){
      calc-=8; 
      pc1CRC_AF+=8;
    }else if (calc >= 4){
      calc-=4; 
      pc1APP_ST+=4;
    }else {
      pc1ADRCHK = calc; 
      i=1;
    }
  }
}
/****************************************************************
*FUNCTION NAME:Split PKTCTRL0
*FUNCTION     :none
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::Split_PKTCTRL0(void){
  int calc = SpiReadStatus(8);
  pc0WDATA = 0;
  pc0PktForm = 0;
  pc0CC2400_EN = 0;
  pc0CRC_EN = 0;
  pc0LenConf = 0;
  for (bool i = 0; i==0;){
    if (calc >= 64){        // 1 bit
      calc-=64; 
      pc0WDATA+=64;
    }else if (calc >= 16){  // 2 bits
      calc-=16;
      pc0PktForm+=16;
    }else if (calc >= 8){   // 1 bit
      calc-=8;
      pc0CC2400_EN+=8;
    }else if (calc >= 4){   // 1 bit
      calc-=4;
      pc0CRC_EN+=4;
    }else if (calc >= 1){   // 1 bits
      calc-=1;
      pc0LenConf+= 1;
    }else{
      i=1;
    }
  }
}
/****************************************************************
*FUNCTION NAME:Split MCSM0
*FUNCTION     :none
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::Split_MCSM0(void){
  int calc = SpiReadStatus(CC2500_MCSM0);
  mc0FS_AUTOCAL     = 0;  // 0x00 off  
                          // 0x10 When going from IDLE to RX or TX
                          // 0x20 When going from RX or TX back to IDLE automatically
                          // 0x30 Every 4th time when going from RX or TX to IDLE automatically
  mc0PO_TIMEOUT     = 0;  // 0x00 1 count  0x04 16 counts  0x08 64 counts  0x0C 256 counts
  mc0PIN_CTRL_EN    = 0;  // 0x00 off  0x02 on
  mc0XOSC_FORCE_ON  = 0;  // 0x00 off  0x01 on

  for (bool i = 0; i==0;){
    if (calc >= 16){
      calc-=16;
      mc0FS_AUTOCAL+=16;
    }else if (calc >= 4){
      calc-=4;
      mc0PO_TIMEOUT+=4;
    }else if (calc >= 2){
      calc-=2;
      mc0PIN_CTRL_EN+=2;
    }else {
      mc0XOSC_FORCE_ON = calc;
      i=1;
    }
  }
}
/****************************************************************
*FUNCTION NAME:Split MDMCFG1
*FUNCTION     :none
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::Split_MDMCFG1(void){
  int calc = SpiReadStatus(19);
  m1FEC = 0;
  m1PRE = 0;
  m1CHSP = 0;
  int s2 = 0;
  for (bool i = 0; i==0;){
    if (calc >= 128){
      calc-=128;
      m1FEC+=128;
    }else if (calc >= 16){
      calc-=16;
      m1PRE+=16;
    }else {
      m1CHSP = calc;
      i=1;
    }
  }
}
/****************************************************************
*FUNCTION NAME:Split MDMCFG2
*FUNCTION     :none
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::Split_MDMCFG2(void){
  int calc = SpiReadStatus(18);
  m2DCOFF = 0;
  m2MODFM = 0;
  m2MANCH = 0;
  m2SYNCM = 0;
  for (bool i = 0; i==0;){
    if (calc >= 128){
      calc-=128;
      m2DCOFF+=128;
    }else if (calc >= 16){
      calc-=16;
      m2MODFM+=16;
    }else if (calc >= 8){
      calc-=8;
      m2MANCH+=8;
    }else{
      m2SYNCM = calc;
      i=1;
    }
  }
}
/****************************************************************
*FUNCTION NAME:Split MDMCFG4
*FUNCTION     :none
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::Split_MDMCFG4(void){
  int calc = SpiReadStatus(16);
  m4RxBw = 0;
  m4DaRa = 0;
  for (bool i = 0; i==0;){
    if (calc >= 64){
      calc-=64;
      m4RxBw+=64;
    }else if (calc >= 16){
      calc -= 16;
      m4RxBw+=16;
    }else{
      m4DaRa = calc;
      i=1;
    }
  }
}
/****************************************************************
*FUNCTION NAME:RegConfigSettings
*FUNCTION     :CC2500 register config //details refer datasheet of CC2500//
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::RegConfigSettings(void){   
    SpiWriteReg(CC2500_FSCTRL1,  0x0F);
    
    //setCCMode(ccmode);
    setMHZ(MHz);
    
    SpiWriteReg(CC2500_MDMCFG1,  0x03); //  defaulting to a channel spcing of 333 kHz so every 3 channels is ~1MHz, no FEC or preamble
    SpiWriteReg(CC2500_MDMCFG0,  0xA4); //  setting for 333. default is 248 (0xF8). The default values give 199.951 kHz channel spacing (the closest setting to 200 kHz), assuming 26.0 MHz crystal frequency.
    SpiWriteReg(CC2500_CHANNR,   chan); //  chan is set to 0. 
    SpiWriteReg(CC2500_DEVIATN,  0x63); //  139.64 kHz deviation
    SpiWriteReg(CC2500_FREND1,   0x56); //  Front End RX Configuration
    SpiWriteReg(CC2500_MCSM0 ,   0x14); //  AUTO calibrate. po timeout 16 counts
    SpiWriteReg(CC2500_FOCCFG,   0x36); //  Frequency Offset Compensation Configuration
    SpiWriteReg(CC2500_BSCFG,    0x6C); //  Bit Synchronization Configuration
    SpiWriteReg(CC2500_AGCCTRL2, 0x03); //  AGC Control
    SpiWriteReg(CC2500_AGCCTRL1, 0x40); //  AGC Control
    SpiWriteReg(CC2500_AGCCTRL0, 0x91); //  AGC Control
    SpiWriteReg(CC2500_FSCAL3,   0xA9); //  Frequency Synthesizer Calibration
    SpiWriteReg(CC2500_FSCAL2,   0x0A); //  Frequency Synthesizer Calibration
    SpiWriteReg(CC2500_FSCAL1,   0x20); //  Frequency Synthesizer Calibration
    SpiWriteReg(CC2500_FSCAL0,   0x0d); //  Frequency Synthesizer Calibration
    //SpiWriteReg(CC2500_FSTEST,   0x59);
    SpiWriteReg(CC2500_TEST2,    0x88); //  Set to 0x81 for improved sensitivity at data rates <= 100 kbaud
    SpiWriteReg(CC2500_TEST1,    0x31); //  Set to 0x35 for improved sensitivity at data rates ≤100 kBaud.
    SpiWriteReg(CC2500_TEST0,    0x0B);
    SpiWriteReg(CC2500_PKTCTRL1, 0x04);
    SpiWriteReg(CC2500_ADDR,     0x00);
    SpiWriteReg(CC2500_PKTLEN,   0xFF);
}
/****************************************************************
*FUNCTION NAME:SetTx
*FUNCTION     :set CC2500 send data
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::SetTx(void){
  SpiStrobe(CC2500_SIDLE);
  SpiStrobe(CC2500_STX);        //start send
  trxstate=1;
}
/****************************************************************
*FUNCTION NAME:SetRx
*FUNCTION     :set CC2500 to receive state
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::SetRx(void){
  SpiStrobe(CC2500_SIDLE);
  SpiStrobe(CC2500_SRX);        //start receive
  trxstate=2;
}
/****************************************************************
*FUNCTION NAME:SetTx
*FUNCTION     :set CC2500 send data and change frequency
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::SetTx(float mhz){
  SpiStrobe(CC2500_SIDLE);
  setMHZ(mhz);
  SpiStrobe(CC2500_STX);        //start send
  trxstate=1;
}
/****************************************************************
*FUNCTION NAME:SetRx
*FUNCTION     :set CC2500 to receive state and change frequency
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::SetRx(float mhz){
  SpiStrobe(CC2500_SIDLE);
  setMHZ(mhz);
  SpiStrobe(CC2500_SRX);        //start receive
  trxstate=2;
}
/****************************************************************
*FUNCTION NAME:RSSI Level
*FUNCTION     :Calculating the RSSI Level
*INPUT        :none
*OUTPUT       :none
****************************************************************/
int CC2500::getRssi(void){
  int rssi;
  rssi=SpiReadStatus(CC2500_RSSI);
  if (rssi >= 128){
    rssi = (rssi-256)/2-74;
  }else{
    rssi = (rssi/2)-74;
  }
  return rssi;
}
/****************************************************************
*FUNCTION NAME:LQI Level
*FUNCTION     :get Lqi state
*INPUT        :none
*OUTPUT       :none
****************************************************************/
byte CC2500::getLqi(void){
byte lqi;
lqi=SpiReadStatus(CC2500_LQI);
return lqi;
}
/****************************************************************
*FUNCTION NAME:SetSres
*FUNCTION     :Reset CC2500
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setSres(void){
  SpiStrobe(CC2500_SRES);
  trxstate=0;
}
/****************************************************************
*FUNCTION NAME:setSidle
*FUNCTION     :set Rx / TX Off
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::setSidle(void){
  SpiStrobe(CC2500_SIDLE);
  trxstate=0;
}
/****************************************************************
*FUNCTION NAME:goSleep
*FUNCTION     :set CC2500 Sleep on
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void CC2500::goSleep(void){
  trxstate=0;
  SpiStrobe(0x36);//Exit RX / TX, turn off frequency synthesizer and exit
  SpiStrobe(0x39);//Enter power down mode when CSn goes high.
}
/****************************************************************
*FUNCTION NAME:Char direct SendData
*FUNCTION     :use CC2500 send data
*INPUT        :txBuffer: data array to send; size: number of data to send, no more than 61
*OUTPUT       :none
****************************************************************/
void CC2500::SendData(char *txchar){
  int len = strlen(txchar);
  byte chartobyte[len];
  for (int i = 0; i<len; i++){
    chartobyte[i] = txchar[i];
  }
  SendData(chartobyte,len);
}
/****************************************************************
*FUNCTION NAME:SendData
*FUNCTION     :use CC2500 send data
*INPUT        :txBuffer: data array to send; size: number of data to send, no more than 61
*OUTPUT       :none
****************************************************************/
void CC2500::SendData(byte *txBuffer,byte size){
  SpiWriteReg(CC2500_TXFIFO,size);
  SpiWriteBurstReg(CC2500_TXFIFO,txBuffer,size);   //write data to send
  SpiStrobe(CC2500_SIDLE);
  SpiStrobe(CC2500_STX);                           //start send
  while (!digitalRead(GDO0));                      // Wait for GDO0 to be set -> sync transmitted  
  while (digitalRead(GDO0));                       // Wait for GDO0 to be cleared -> end of packet
  SpiStrobe(CC2500_SFTX);                          //flush TXfifo
  trxstate=1;
}
/****************************************************************
*FUNCTION NAME:Char direct SendData
*FUNCTION     :use CC2500 send data without GDO
*INPUT        :txBuffer: data array to send; size: number of data to send, no more than 61
*OUTPUT       :none
****************************************************************/
void CC2500::SendData(char *txchar,int t){
  int len = strlen(txchar);
  byte chartobyte[len];
  for (int i = 0; i<len; i++){
    chartobyte[i] = txchar[i];
  }
  SendData(chartobyte,len,t);
}
/****************************************************************
*FUNCTION NAME:SendData
*FUNCTION     :use CC2500 send data without GDO
*INPUT        :txBuffer: data array to send; size: number of data to send, no more than 61
*OUTPUT       :none
****************************************************************/
void CC2500::SendData(byte *txBuffer,byte size,int t){
  SpiWriteReg(CC2500_TXFIFO,size);
  SpiWriteBurstReg(CC2500_TXFIFO,txBuffer,size);  //write data to send
  SpiStrobe(CC2500_SIDLE);
  SpiStrobe(CC2500_STX);                          //start send
  delay(t);
  SpiStrobe(CC2500_SFTX);                         //flush TXfifo
  trxstate=1;
}
/****************************************************************
*FUNCTION NAME:Check CRC
*FUNCTION     :none
*INPUT        :none
*OUTPUT       :none
****************************************************************/
bool CC2500::CheckCRC(void){
  byte lqi=SpiReadStatus(CC2500_LQI);
  bool crc_ok = bitRead(lqi,7);
  if (crc_ok == 1){
    return 1;
  }else{
    SpiStrobe(CC2500_SFRX);
    SpiStrobe(CC2500_SRX);
    return 0;
  }
}
/****************************************************************
*FUNCTION NAME:CheckRxFifo
*FUNCTION     :check receive data or not
*INPUT        :none
*OUTPUT       :flag: 0 no data; 1 receive data 
****************************************************************/
bool CC2500::CheckRxFifo(int t){
  if(trxstate!=2){SetRx();}
    if(SpiReadStatus(CC2500_RXBYTES) & BYTES_IN_RXFIFO){
      delay(t);
      return 1;
    }else{
      return 0;
  }
}
/****************************************************************
*FUNCTION NAME:CheckReceiveFlag
*FUNCTION     :check receive data or not
*INPUT        :none
*OUTPUT       :flag: 0 no data; 1 receive data 
****************************************************************/
byte CC2500::CheckReceiveFlag(void){
  if(trxstate!=2){
    SetRx();
  }
	if(digitalRead(GDO0)){			//receive data
		while (digitalRead(GDO0));
		return 1;
	}else{							// no data
		return 0;
	}
}
/****************************************************************
*FUNCTION NAME:ReceiveData
*FUNCTION     :read data received from RXfifo
*INPUT        :rxBuffer: buffer to store data
*OUTPUT       :size of data received
****************************************************************/
byte CC2500::ReceiveData(byte *rxBuffer){
	byte size;
	byte status[2];

	if(SpiReadStatus(CC2500_RXBYTES) & BYTES_IN_RXFIFO)	{
		size=SpiReadReg(CC2500_RXFIFO);
		SpiReadBurstReg(CC2500_RXFIFO,rxBuffer,size);
		SpiReadBurstReg(CC2500_RXFIFO,status,2);
		SpiStrobe(CC2500_SFRX);
    SpiStrobe(CC2500_SRX);
		return size;
	}else{
		SpiStrobe(CC2500_SFRX);
    SpiStrobe(CC2500_SRX);
 		return 0;
	}
}
CC2500 CC2500;
